In [2]:
import pandas as pd
import numpy as np

In [2]:
data = {'color':['blue','green','yellow','red','white'],
       'object':['ball','pen','pencil','paper','mug'],
       'price':[1.2,1.0,0.6,0.9,1.7]}
frame = pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [5]:
frame2 = pd.DataFrame(data, columns=['object','price'])
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [6]:
frame2 = pd.DataFrame(data,index=['one','two','three','four','five'])
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [6]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)), index=['red','blue','yellow','white'],
                      columns=['ball','pen','pencil','paper'])
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [8]:
frame3.columns

Index([u'ball', u'pen', u'pencil', u'paper'], dtype='object')

In [9]:
frame3.index

Index([u'red', u'blue', u'yellow', u'white'], dtype='object')

In [11]:
frame3.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [12]:
frame3.ball

red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int64

In [13]:
frame3['ball']

red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int64

In [15]:
frame3.ix[2]

/home/minzhang/anaconda2/envs/pda/lib/python2.7/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int64

In [17]:
frame3.loc['yellow']

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int64

In [18]:
frame3.iloc[2]

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int64

In [19]:
frame3.ix[[0,2]]

/home/minzhang/anaconda2/envs/pda/lib/python2.7/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11

In [20]:
frame3.iloc[[0,2]]

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11

In [21]:
frame3.loc[['red','yellow']]

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11

In [31]:
frame3[0:3]

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11

In [46]:
frame3.columns.name = 'item'
frame3.index.name = 'id'
frame3

item    ball  pen  pencil  paper
id
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [48]:
frame3['new'] = 12
frame3

item    ball  pen  pencil  paper  new
id
red        0    1       2      3   12
blue       4    5       6      7   12
yellow     8    9      10     11   12
white     12   13      14     15   12

In [51]:
# notice if the list is incomplete, raise exception,but if list becomes series, no exception will be thrown
frame3['new'] = [1,2,3,4]

In [55]:
ser = pd.Series(np.arange(4))
ser

0    0
1    1
2    2
3    3
dtype: int64

In [61]:
frame['new'] = ser
# frame['new'] = [1,2,3,4] #error
# frame['new'] = [1,2,3,4,5] # no error
frame

    color  object  price  new
0    blue    ball    1.2  0.0
1   green     pen    1.0  1.0
2  yellow  pencil    0.6  2.0
3     red   paper    0.9  3.0
4   white     mug    1.7  NaN

In [77]:
ser = pd.Series(np.arange(5))
ser

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [78]:
frame['new'] = ser
frame

    color  object  price  new
0    blue    ball    1.2    0
1   green     pen    1.0    1
2  yellow  pencil    0.6    2
3     red   paper    0.9    3
4   white     mug    1.7    4

In [72]:
frame.color[1:3]

1     green
2    yellow
Name: color, dtype: object

In [73]:
frame3

item    ball  pen  pencil  paper  new
id
red        0    1       2      3    1
blue       4    5       6      7    2
yellow     8    9      10     11    3
white     12   13      14     15    4

In [75]:
frame3.ball

id
red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int64

In [79]:
frame

    color  object  price  new
0    blue    ball    1.2    0
1   green     pen    1.0    1
2  yellow  pencil    0.6    2
3     red   paper    0.9    3
4   white     mug    1.7    4

In [85]:
frame.isin([1,'pen'])

   color  object  price    new
0  False   False  False  False
1  False    True   True   True
2  False   False  False  False
3  False   False  False  False
4  False   False  False  False

In [86]:
frame[frame.isin([1,'pen'])]

  color object  price  new
0   NaN    NaN    NaN  NaN
1   NaN    pen    1.0  1.0
2   NaN    NaN    NaN  NaN
3   NaN    NaN    NaN  NaN
4   NaN    NaN    NaN  NaN

In [87]:
del frame['new']

In [88]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [91]:
frame3[frame3<12]

item    ball  pen  pencil  paper  new
id
red      0.0  1.0     2.0    3.0    1
blue     4.0  5.0     6.0    7.0    2
yellow   8.0  9.0    10.0   11.0    3
white    NaN  NaN     NaN    NaN    4

In [98]:
nestdict = {'red':{2012:22, 2013:33},
                   'white':{2011:13,2012:22,2013:23},
                   'bule':{2011:22}}
frame2 = pd.DataFrame(nestdict)
frame2

      bule   red  white
2011  22.0   NaN     13
2012   NaN  22.0     22
2013   NaN  33.0     23

In [3]:
# you'd better convert the list to service , or you will get an error
nest = {'red':pd.Series([1,2]),
                   'white':pd.Series([2]),
                   'bule':pd.Series([1,2])}
frame10 = pd.DataFrame(nest)
frame10

   bule  red  white
0     1    1    2.0
1     2    2    NaN

In [105]:
frame10.T

         0    1
bule   1.0  2.0
red    1.0  2.0
white  2.0  NaN

In [121]:
ser = pd.Series([5, 0,3,8,4], index = ['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [125]:
# index container duplicate tags
serd = pd.Series(range(6), index= ['white','white','bule','green','green','yellow'])
serd

white     0
white     1
bule      2
green     3
green     4
yellow    5
dtype: int64

In [126]:
serd['white']

white    0
white    1
dtype: int64

In [127]:
serd.index.is_unique

False

In [4]:
frame10

   bule  red  white
0     1    1    2.0
1     2    2    NaN

In [7]:
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [12]:
# frame3.reindex(range(6), method='bfill', columns = ['ball','pen','pencil','paper'])
frame10.reindex(range(6), method='bfill')

   bule  red  white
0   1.0  1.0    2.0
1   2.0  2.0    NaN
2   NaN  NaN    NaN
3   NaN  NaN    NaN
4   NaN  NaN    NaN
5   NaN  NaN    NaN

In [14]:
ser = pd.Series(np.arange(4), index = ['red','blue','yellow','white'])
ser

red       0
blue      1
yellow    2
white     3
dtype: int64

In [15]:
ser.drop(['red','blue'])

yellow    2
white     3
dtype: int64

In [16]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=['red','blue','yellow','white'], 
                                                    columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [20]:
frame.drop(['blue'])

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11
white     12   13      14     15

In [24]:
frame.drop(['pencil'],axis=1)

        ball  pen  paper
red        0    1      3
blue       4    5      7
yellow     8    9     11
white     12   13     15

In [25]:
s1 = pd.Series([3,2,5,1], ['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1], ['white','yellow','black','blue','brown'])
s1+s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [29]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)), index=['red','blue','yellow','white'],
                                                    columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)), index=['red','green','white','yellow'],
                                                    columns=['mug','pen','ball'])

frame1+frame2

        ball  mug  paper   pen  pencil
blue     NaN  NaN    NaN   NaN     NaN
green    NaN  NaN    NaN   NaN     NaN
red      2.0  NaN    NaN   2.0     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [30]:
frame1.add(frame2)

        ball  mug  paper   pen  pencil
blue     NaN  NaN    NaN   NaN     NaN
green    NaN  NaN    NaN   NaN     NaN
red      2.0  NaN    NaN   2.0     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [31]:
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [39]:
# ser = pd.Series(np.arange(4), index=['red','blue','yellow','white'])
ser = pd.Series(np.arange(4), index=['ball','pen','pencil','paper'])

ser['mug'] = 9
# ser

In [40]:
serb

ball      0
pen       1
pencil    2
paper     3
mug       9
dtype: int64

In [45]:
frame1.add(ser)

        ball  mug  paper  pen  pencil
red        0  NaN      6    2       4
blue       4  NaN     10    6       8
yellow     8  NaN     14   10      12
white     12  NaN     18   14      16

In [46]:
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [47]:
np.log(frame1)

/home/minzhang/anaconda2/envs/pda/lib/python2.7/site-packages/ipykernel/__main__.py:1: RuntimeWarning: divide by zero encountered in log
  if __name__ == '__main__':

            ball       pen    pencil     paper
red         -inf  0.000000  0.693147  1.098612
blue    1.386294  1.609438  1.791759  1.945910
yellow  2.079442  2.197225  2.302585  2.397895
white   2.484907  2.564949  2.639057  2.708050

In [48]:
frame1.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [49]:
frame1.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [4]:
ser = pd.Series([5,0,3,8,4],index=['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [5]:
ser.sort_index()

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [6]:
ser.sort_index(ascending=False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [7]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index=['red','blue','yellow','white'], columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [8]:
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [9]:
frame.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [11]:
ser.sort_values()

blue      0
yellow    3
green     4
red       5
white     8
dtype: int64

In [13]:
frame.sort_values(by='pen')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [15]:
frame.sort_values(by=['ball','pen'], ascending=False)

        ball  pen  pencil  paper
white     12   13      14     15
yellow     8    9      10     11
blue       4    5       6      7
red        0    1       2      3

In [19]:
ser = pd.Series([5,0,3,8,4],index=['red','blue','yellow','white','green'])
ser.rank()

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [20]:
ser.rank(method='first')

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [21]:
ser.rank(ascending=False)

red       2.0
blue      5.0
yellow    4.0
white     1.0
green     3.0
dtype: float64

In [3]:
ser = pd.Series([0,1,2,np.NAN,9], index=['red','blue','yellow','white','green'])
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [5]:
ser['white'] = None
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [6]:
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [7]:
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [8]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [14]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]], index=['blue','green','red'],
                     columns=['ball','mug','pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [10]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [13]:
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

In [14]:
frame3.fillna(1)

       ball  mug  pen
blue    6.0  1.0  6.0
green   1.0  1.0  1.0
red     2.0  1.0  5.0

In [18]:
frame3.fillna({'ball':1,'mug':2,'pen':3})

       ball  mug  pen
blue    6.0  2.0  6.0
green   1.0  2.0  3.0
red     2.0  2.0  5.0

In [7]:
import pandas as pd
import numpy as np
mser = pd.Series(np.random.rand(8), index=[['white','white','white','blue','blue','red','red','red'],
                                          ['up','down','right','up','down','up','down','left']])
mser.index

MultiIndex(levels=[[u'blue', u'red', u'white'], [u'down', u'left', u'right', u'up']],
           labels=[[2, 2, 2, 0, 0, 1, 1, 1], [3, 0, 2, 3, 0, 3, 0, 1]])

In [8]:
mser['white']

up       0.280924
down     0.090811
right    0.633370
dtype: float64

In [9]:
mser[:,'up']

white    0.280924
blue     0.730575
red      0.928218
dtype: float64

In [10]:
mser['white','up']

0.2809239827815978

In [11]:
mser

white  up       0.280924
       down     0.090811
       right    0.633370
blue   up       0.730575
       down     0.024410
red    up       0.928218
       down     0.125395
       left     0.399525
dtype: float64

In [12]:
mser.unstack()

           down      left    right        up
blue   0.024410       NaN      NaN  0.730575
red    0.125395  0.399525      NaN  0.928218
white  0.090811       NaN  0.63337  0.280924

In [15]:
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [16]:
frame3.stack()

blue  ball    6.0
      pen     6.0
red   ball    2.0
      pen     5.0
dtype: float64

In [51]:
mframe = pd.DataFrame(np.random.randn(4,4), 
                     index=[['white','white','red','red'],['up','down','up','down']],
                     columns=[['pen','pen','paper','paper'],[1,2,1,2]])
mframe

                 pen               paper
                   1         2         1         2
white up    0.336195  1.562007  2.082146  0.095185
      down -0.938048 -0.459868  0.358918 -1.950334
red   up   -0.307720 -0.173156  1.641742 -0.073868
      down  2.739094 -1.537686 -1.733758  0.399168

In [53]:
mframe.columns.names = ['objects','id']

In [21]:
mframe

objects          pen               paper
id                 1         2         3         4
white up    0.120571 -1.393276 -0.895132 -0.715251
red   down  0.836896 -0.285779  0.118691 -1.054076
white up    0.788582 -0.786866  0.465219 -0.471619
red   down -0.535310 -0.099315 -0.572563  1.057433

In [52]:
mframe.index.names = ['colors','status']

In [23]:
mframe

objects            pen               paper
id                   1         2         3         4
color status
white up      0.120571 -1.393276 -0.895132 -0.715251
red   down    0.836896 -0.285779  0.118691 -1.054076
white up      0.788582 -0.786866  0.465219 -0.471619
red   down   -0.535310 -0.099315 -0.572563  1.057433

In [27]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         3         4
status colors
up     white   0.120571 -1.393276 -0.895132 -0.715251
down   red     0.836896 -0.285779  0.118691 -1.054076
up     white   0.788582 -0.786866  0.465219 -0.471619
down   red    -0.535310 -0.099315 -0.572563  1.057433

In [35]:
mframe.sort_index(axis=0)

objects             pen               paper
id                    1         2         3         4
colors status
red    down    0.836896 -0.285779  0.118691 -1.054076
       down   -0.535310 -0.099315 -0.572563  1.057433
white  up      0.120571 -1.393276 -0.895132 -0.715251
       up      0.788582 -0.786866  0.465219 -0.471619

In [48]:
mframe.sort_values(by=('pen',1))

objects             pen               paper
id                    1         2         3         4
colors status
white  down   -1.169693  0.389626  1.044896 -0.852569
red    down   -0.578424  1.699581  0.454802  0.011019
       up      0.363396  1.632965  0.890367 -0.823634
white  up      2.300103  1.794772 -0.284453 -0.595931

In [55]:
mframe.sum(level='status')

objects       pen               paper
id              1         2         1         2
status
up       0.028475  1.388851  3.723888  0.021317
down     1.801046 -1.997554 -1.374840 -1.551166

In [54]:
mframe.sum(level='id',axis=1)

id                    1         2
colors status
white  up      2.418341  1.657192
       down   -0.579130 -2.410202
red    up      1.334022 -0.247023
       down    1.005335 -1.138518